In [133]:
%pip install pyodbc

import pyodbc
import pandas as pd

server = 'LAPTOP-USMIAD3A\SQLEXPRESS'


#Connect to existing database
# connection = pyodbc.connect(
#     'Driver={SQL Server};'
#     'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
#     'Database=AdventureWorksDW2017;'
#     'Trusted_Connection=yes;'
# )

#Connect To Server
connection = pyodbc.connect(
    'Driver={SQL Server};'
    'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
)

print("Connected")

Requirement already satisfied: pyodbc in c:\users\jorge\anaconda3\lib\site-packages (4.0.0-unsupported)
Note: you may need to restart the kernel to use updated packages.
Connected

In [134]:
def sql(query):
    try:
        cursor = connection.cursor()
        cursor.execute(query)
        connection.commit()
        print("Done")
    except Exception as e:
        print(f"An error occurred: {e}")

In [135]:
# #Using cursor.execute
# cursor.execute("SELECT TOP 10 FirstName FROM DimEmployee")
# results = cursor.fetchall()
# for row in results:
#     print(row)

# #Using pd.read_sql
# sql_query = "SELECT TOP 10 * FROM DimEmployee"
# df = pd.read_sql(sql_query, connection)
# df

database="businessERP"
sql("CREATE DATABASE businessERP")

Done

In [136]:
connection = pyodbc.connect(
    'Driver={SQL Server};'
    'Server=LAPTOP-USMIAD3A\SQLEXPRESS;'
    'Database=businessERP;'
    'Trusted_Connection=yes;'
)

print("Done")

Done

In [137]:
def pdsql(sql_query):
    try:
        df = pd.read_sql(sql_query, connection)
        return df
    
    except Exception as e:
        print(f"An error occurred: {e}")

In [138]:
sql("CREATE TABLE company(companyID int, companyName varchar(200), createdDate DATETIME)")

Done

In [139]:
sql("INSERT INTO company (companyID, companyName, createdDate) VALUES (1, 'Livepath', convert(datetime,'28-03-23 00:00:00 AM',5))")

Done

In [140]:
sql_query = "SELECT TOP 2 * FROM company"
df = pd.read_sql(sql_query, connection)
df

   companyID companyName createdDate
0          1    Livepath  2023-03-28

In [141]:
sql("CREATE TABLE employees(employeeID int, first_name VARCHAR(200), last_name VARCHAR(200), email VARCHAR(200), gender VARCHAR(200), related_company INT)")

Done

In [142]:
df = pd.read_csv(r'C:\Users\jorge\Desktop\DatasetSQLs\employees.csv')

df.head()

,id,first_name,last_name,email,gender,related_company
0,1,Bernie,Mogford,bmogford0@ow.ly,Male,1
1,2,Mignonne,Baumler,mbaumler1@google.com.au,Female,1
2,3,Kain,Chaney,kchaney2@usda.gov,Male,1
3,4,Templeton,Woodyer,twoodyer3@amazon.co.jp,Non-binary,1
4,5,Putnem,Singleton,psingleton4@google.com.br,Male,1

In [143]:
cursor = connection.cursor()

for row in df.itertuples():
    cursor.execute("INSERT INTO businessERP.dbo.employees (employeeID, first_name, last_name, email, gender, related_company) VALUES (?, ?, ?, ?, ?, ?)", 
                   row.id, row.first_name, row.last_name, row.email, row.gender, row.related_company)
    
connection.commit()

In [144]:
pdsql("SELECT TOP 10 * FROM employees")

,employeeID,first_name,last_name,email,gender,related_company
0,1,Bernie,Mogford,bmogford0@ow.ly,Male,1
1,2,Mignonne,Baumler,mbaumler1@google.com.au,Female,1
2,3,Kain,Chaney,kchaney2@usda.gov,Male,1
3,4,Templeton,Woodyer,twoodyer3@amazon.co.jp,Non-binary,1
4,5,Putnem,Singleton,psingleton4@google.com.br,Male,1
5,6,Darb,Gloster,dgloster5@mysql.com,Female,1
6,7,Hube,Lazare,hlazare6@npr.org,Male,1
7,8,Ina,Izsak,iizsak7@indiegogo.com,Female,1
8,9,Stinky,Helks,shelks8@is.gd,Male,1
9,10,Gannie,Worley,gworley9@usnews.com,Male,1

In [145]:
pdsql("SELECT table_name FROM INFORMATION_SCHEMA.TABLES")

  table_name
0    company
1  employees

In [146]:
#Delete database
#sql("USE master; ALTER DATABASE businessERP SET SINGLE_USER WITH ROLLBACK IMMEDIATE; DROP DATABASE businessERP;")

In [147]:
connection.close()